Repository: Russidan-Nadee/Kinrai-D
Catalog: frontend/lib/l10n/app_*.arb
Languages: ja, th, zh

# welcome
source: Welcome to Kinrai D!
ja: Kinrai Dへようこそ！
th: ยินดีต้อนรับสู่ Kinrai D!
zh: 欢迎来到 Kinrai D！

# tapToRandomMenu
source: Tap to random delicious menu
ja: ボタンを押して美味しいメニューをランダムに選択
th: กดปุ่มเพื่อสุ่มเมนูอาหารแสนอร่อย
zh: 点击按钮随机选择美味菜单

source: Random Menu
ja: ランダムメニュー
th: สุ่มเมนูอาหาร
zh: 随机菜单

source: Recommended Menu
ja: おすすめメニュー
th: เมนูที่แนะนำ
zh: 推荐菜单

# cannotRandomMenu
source: Cannot random menu. Please try again.
ja: メニューをランダムに選択できません。もう一度お試しください。
th: ไม่สามารถสุ่มเมนูได้ กรุณาลองใหม่อีกครั้ง
zh: 无法随机选择菜单，请重试。

# noRating
source: No rating yet
ja: 評価なし
th: ยังไม่มีคะแนน
zh: 暂无评分

source: User
ja: ユーザー
th: ผู้ใช้งาน
zh: 用户

# manageSettings
source: Manage your settings
ja: 設定を管理する
th: จัดการการตั้งค่าของคุณ
zh: 管理您的设置

source: Select Language
ja: 言語を選択
th: เลือกภาษา
zh: 选择语言

# languageChanged
source: Language changed to {language}
ja: 言語を{language}に変更しました
th: เปลี่ยนภาษาเป็น {language} แล้ว
zh: 已切换到{language}

# otherFeaturesDeveloping
source: Other features are being developed
ja: その他の機能を開発中
th: ฟีเจอร์อื่นๆ กำลังพัฒนา
zh: 其他功能正在开发中

source: Coming soon!
ja: 近日公開！
th: เร็วๆ นี้!
zh: 即将推出！

source: Main
ja: メイン
th: หน้าหลัก
zh: 主页

source: Profile
ja: プロフィール
th: โปรไฟล์
zh: 个人资料

source: Admin
ja: 管理者
th: ผู้ดูแล
zh: 管理员

# errorOccurred
source: An error occurred. Please try again
th: เกิดข้อผิดพลาด กรุณาลองใหม่อีกครั้ง
zh: 发生错误，请重试
